app/controllers/reviews_controller.rb

  def index
    @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

def edit
  @product = Product.find(params[:product_id])
  @review = Review.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @product = Product.find(params[:product_id])
    @review = @product.reviews.new
    @review.comment = params[:review][:comment]

    if @review.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "reviews" ("product_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 3], ["comment", "Woohoo"], ["created_at", "2017-08-02 20:02:16.930984"], ["updated_at", "2017-08-02 20:02:16.930984"]]

  def update
    @review = Review.find(params[:id])

    if @review.update(comment: params[:review][:comment])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "This is a pretty darn good spinner!"], ["updated_at", "2017-08-03 18:07:30.623595"], ["id", 1]]